In [6]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [10]:
import os
os.getcwd()  # Muestra el directorio actual donde estás trabajando

'/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS'

In [14]:
import os
print(os.path.exists('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/artist.csv'))

True

In [15]:
artists = pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/artist.csv')

In [16]:
artists.head()

,artist_id,full_name,first_name,middle_names,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Auguste,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,NaN,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,NaN,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,NaN,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,NaN,Macke,German,Expressionist,1887,1914

In [18]:
museums = pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/museum.csv')

In [6]:
museums.head()

,museum_id,name,address,city,state,postal,country,phone,url
0,30,The Museum of Modern Art,11 W 53rd St,New York,NY,10019,USA,+1 212 708-9400,https://www.moma.org/
1,31,Pushkin State Museum of Fine Arts,12 Ulitsa Volkhonka,Moscow,NaN,119019,Russia,+7 495 697-95-78,https://pushkinmuseum.art/
2,32,National Gallery of Victoria,180 St Kilda Rd,Melbourne,Victoria,3004,Australia,+61 (0)3 8620 2222,https://www.ngv.vic.gov.au/
3,33,São Paulo Museum of Art,"Av. Paulista, 1578 - Bela Vista",São Paulo,NaN,01310-200,Brazil,+55 11 3149-5959,https://masp.org.br/
4,34,The State Hermitage Museum,Palace Square,2,Sankt-Peterburg,190000,Russia,7 812 710-90-79,https://www.hermitagemuseum.org/wps/portal/her...

In [19]:
canvas = pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/canvas_size.csv')

In [8]:
canvas.head()

   size_id  width  height          label
0       20     20     NaN  20" Long Edge
1       24     24     NaN  24" Long Edge
2       30     30     NaN  30" Long Edge
3       36     36     NaN  36" Long Edge
4       40     40     NaN  40" Long Edge

In [20]:
image = pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/image_link.csv')

In [10]:
image.head()

,work_id,url,thumbnail_small_url,thumbnail_large_url
0,181978,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
1,173188,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
2,194065,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
3,129337,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
4,141073,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...

In [21]:
museums_hours=pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/museum_hours.csv')

In [12]:
museums_hours.head()

   museum_id        day      open     close
0         30     Sunday  10:30:AM  05:30:PM
1         30     Monday  10:30:AM  05:30:PM
2         30    Tuesday  10:30:AM  05:30:PM
3         30  Wednesday  10:30:AM  05:30:PM
4         30    Thusday  10:30:AM  05:30:PM

In [ ]:
#PK from museums is museums id for which this is the PK from museums hours, here we can join the content

In [22]:
product=pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/product_size.csv')

In [14]:
product.head()

   work_id size_id  sale_price  regular_price
0   160228      24          85             85
1   160228      30          95             95
2   160236      24          85             85
3   160236      30          95             95
4   160244      24          85             85

In [ ]:
#From product and form image we have the key value: work_id

In [23]:
subject=pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/subject.csv')

In [16]:
subject.head()

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [17]:
#relation: subject/product/image

In [24]:
work=pd.read_csv('/Users/inesmarina/Desktop/ BOOTCAMP_DESCARGAS_DRIVE/PROYECTO_SQL/PAINTINGS/work.csv')

In [19]:
work.head()

,work_id,name,artist_id,style,museum_id
0,160228,Still Life with Flowers and a Watch,615,Baroque,43.0
1,160236,Still Life with Fruit and a Beaker on a Cock's...,615,Baroque,43.0
2,160244,Still Life with Fruit and a Goldfinch,615,Baroque,43.0
3,160252,Still Life with Fruit and Oysters,615,Baroque,43.0
4,160260,"Still Life with Fruit, Oysters, and a Porcelai...",615,Baroque,43.0

In [39]:
artists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   artist_id     421 non-null    int64
 1   full_name     421 non-null    object
 2   first_name    421 non-null    object
 3   middle_names  148 non-null    object
 4   last_name     421 non-null    object
 5   nationality   421 non-null    object
 6   style         421 non-null    object
 7   birth         421 non-null    int64
 8   death         421 non-null    int64
dtypes: int64(3), object(6)
memory usage: 29.7+ KB

In [40]:
museums.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  57 non-null     int64
 1   name       57 non-null     object
 2   address    57 non-null     object
 3   city       57 non-null     object
 4   state      38 non-null     object
 5   postal     50 non-null     object
 6   country    57 non-null     object
 7   phone      57 non-null     object
 8   url        57 non-null     object
dtypes: int64(1), object(8)
memory usage: 4.1+ KB

In [42]:
image.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14775 entries, 0 to 14774
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   work_id              14775 non-null  int64
 1   url                  14775 non-null  object
 2   thumbnail_small_url  14773 non-null  object
 3   thumbnail_large_url  14773 non-null  object
dtypes: int64(1), object(3)
memory usage: 461.8+ KB

In [41]:
museums_hours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  351 non-null    int64
 1   day        351 non-null    object
 2   open       351 non-null    object
 3   close      351 non-null    object
dtypes: int64(1), object(3)
memory usage: 11.1+ KB

In [43]:
work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14776 entries, 0 to 14775
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   work_id    14776 non-null  int64
 1   name       14776 non-null  object
 2   artist_id  14776 non-null  int64
 3   style      13490 non-null  object
 4   museum_id  4553 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 577.3+ KB

In [44]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110347 entries, 0 to 110346
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   work_id        110347 non-null  int64
 1   size_id        110347 non-null  object
 2   sale_price     110347 non-null  int64
 3   regular_price  110347 non-null  int64
dtypes: int64(3), object(1)
memory usage: 3.4+ MB

In [45]:
canvas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   size_id  200 non-null    int64
 1   width    200 non-null    int64
 2   height   193 non-null    float64
 3   label    200 non-null    object
dtypes: float64(1), int64(2), object(1)
memory usage: 6.4+ KB

In [46]:
subject.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6771 entries, 0 to 6770
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   work_id  6771 non-null   int64
 1   subject  6771 non-null   object
dtypes: int64(1), object(1)
memory usage: 105.9+ KB

In [20]:
#relation: subject/product/image/work
#relation: work/artist
#relation: work/museums 
    #Work will be the primary table to relate to every other table

In [ ]:
#work: PK work id // PK museum_id // PK artist_id
#subject: PK work_id
#product: PK work_id // size_id
#museums_hours: PK museum_id
#museums: PK museum_id
#artist: PK artists_id
#canvs: PK  size_id

In [52]:
work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14776 entries, 0 to 14775
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   work_id    14776 non-null  int64
 1   name       14776 non-null  object
 2   artist_id  14776 non-null  int64
 3   style      13490 non-null  object
 4   museum_id  4553 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 577.3+ KB

In [49]:
subject.head()

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [25]:
import sqlalchemy as alch # python -m pip install --upgrade 'sqlalchemy<2.0'
from getpass import getpass

In [26]:
password = getpass("Please enter your password: ")

In [27]:
dbName = "paintings"

In [28]:
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [29]:
engine = alch.create_engine(connectionData)

In [30]:
engine

Engine(mysql+pymysql://root:***@localhost/paintings)

In [ ]:
#lista de mis DF:
    #aritsts
    #museums
    #image
    #museums_hours
    #product
    #subject
    #work
    #canvas

In [31]:
artists.to_sql(name='artists', con=engine, if_exists='replace', index=False)
museums.to_sql(name='museums', con=engine, if_exists='replace', index=False)
museums_hours.to_sql(name='museums_hours', con=engine, if_exists='replace', index=False)
image.to_sql(name='image', con=engine, if_exists='replace', index=False)
product.to_sql(name='product', con=engine, if_exists='replace', index=False)
subject.to_sql(name='subject', con=engine, if_exists='replace', index=False)
work.to_sql(name='work', con=engine, if_exists='replace', index=False)
canvas.to_sql(name='canvas', con=engine, if_exists='replace', index=False)

200

In [36]:
import socket

In [38]:
class MySQLConnection:
    def __init__(self, host, port, timeout=30):
        self.host = host
        self.port = port
        self.connect_timeout = timeout

    def connect(self):
        sock = socket.create_connection(
            (self.host, self.port), self.connect_timeout
        )
        return sock

# Crear una instancia de la clase y usar el método de conexión
conn = MySQLConnection('localhost', 3306)
sock = conn.connect()  # Esto debería funcionar sin el error de 'self

In [51]:
#After visualizing these DBs in tableau, I could distinguish some issues with the DB museums that I will use: 
#acordarme de exportar a CSV unavex limpie el db
museums.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  57 non-null     int64
 1   name       57 non-null     object
 2   address    57 non-null     object
 3   city       57 non-null     object
 4   state      38 non-null     object
 5   postal     50 non-null     object
 6   country    57 non-null     object
 7   phone      57 non-null     object
 8   url        57 non-null     object
dtypes: int64(1), object(8)
memory usage: 4.1+ KB

In [54]:
museums = museums.replace('UK', 'United Kingdom')

In [56]:
countries_museums= museums['country'].unique()
print(countries_museums)

['USA' 'Russia' 'Australia' 'Brazil' 'Germany' 'France' 'United Kingdom'
 'Netherlands' 'Israel' 'Switzerland' 'Spain' 'Hungary' 'Italy' 'Japan'
 'Norway' 'Czechia']

In [59]:
museums.to_csv('museum.csv', index=False)

In [ ]:
#to asume the state of the missing values from the museum db we can use the postal values to adress these and complete the db

In [ ]:
#NECESITO PROYECTAR LAS QUERIES PARA SACAR CONCLUSIONES